# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 基础版本 - 移除所有注意力机制

# Parameters
nc: 1  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # P1/2    0
  - [-1, 2, C2f_GhostBottleneck, [64, True]]   # P1/2    1
  
  - [-1, 1, Conv, [128, 3, 2]]  # P2/4    2
  - [-1, 3, C2f_GhostBottleneck, [128, True]]   # P2/4    3
  
  - [-1, 1, Conv, [256, 3, 2]]  # P3/8    4
  - [-1, 6, C2f_GhostBottleneck, [256, True]]   # P3/8    5
  
  - [-1, 1, Conv, [512, 3, 2]]  # P4/16   6
  - [-1, 6, C2f_GhostBottleneck, [512, True]]   # P4/16   7
  - [-1, 1, SPPFCSPC, [512, 5]] # P4/16   8

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P3/8    9
  - [[-1, 5], 1, Concat, [1]]                   # P3/8    10
  - [-1, 3, C2f_GhostBottleneck, [256]]        # P3/8    11
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P2/4    12
  - [[-1, 3], 1, Concat, [1]]                   # P2/4    13
  - [-1, 3, C2f_GhostBottleneck, [128]]        # P2/4    14
  
  - [-1, 1, Conv, [256, 3, 2]]                 # P3/8    15
  - [[-1, 11], 1, Concat, [1]]                 # P3/8    16
  - [-1, 3, C2f_GhostBottleneck, [256]]        # P3/8    17
  
  - [-1, 1, Conv, [512, 3, 2]]                 # P4/16   18
  - [[-1, 8], 1, Concat, [1]]                  # P4/16   19
  - [-1, 3, C2f_GhostBottleneck, [512]]        # P4/16   20

  - [[14,17,20], 1, Detect, [nc]]  # Detect(P2/4, P3/8, P4/16) 