# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 SE版本 - 只使用SE注意力机制

# Parameters
nc: 1  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # P1/2    0
  - [-1, 1, SpatialAttention, []]          # P1/2    1
  - [-1, 2, C2f_GhostBottleneck, [64, True]]   # P1/2    2
  
  - [-1, 1, Conv, [128, 3, 2]]  # P2/4    3
  - [-1, 3, C2f_GhostBottleneck, [128, True]]   # P2/4    4
  - [-1, 1, SpatialAttention, []]          # P2/4    5
  
  - [-1, 1, Conv, [256, 3, 2]]  # P3/8    6
  - [-1, 6, C2f_GhostBottleneck, [256, True]]   # P3/8    7
  - [-1, 1, SpatialAttention, []]          # P3/8    8
  
  - [-1, 1, Conv, [512, 3, 2]]  # P4/16   9
  - [-1, 6, C2f_GhostBottleneck, [512, True]]   # P4/16   10
  - [-1, 1, SPPFCSPC, [512, 5]] # P4/16   11

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P3/8    12
  - [[-1, 8], 1, Concat, [1]]                   # P3/8    13
  - [-1, 3, C2f_GhostBottleneck, [256]]        # P3/8    14
  - [-1, 1, SpatialAttention, []]                         # P3/8    15
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # P2/4    16
  - [[-1, 5], 1, Concat, [1]]                   # P2/4    17
  - [-1, 3, C2f_GhostBottleneck, [128]]        # P2/4    18
  - [-1, 1, SpatialAttention, []]                         # P2/4    19
  
  - [-1, 1, Conv, [256, 3, 2]]                 # P3/8    20
  - [[-1, 14], 1, Concat, [1]]                 # P3/8    21
  - [-1, 3, C2f_GhostBottleneck, [256]]        # P3/8    22
  - [-1, 1, SpatialAttention, []]                         # P3/8    23
  
  - [-1, 1, Conv, [512, 3, 2]]                 # P4/16   24
  - [[-1, 11], 1, Concat, [1]]                 # P4/16   25
  - [-1, 3, C2f_GhostBottleneck, [512]]        # P4/16   26
  - [-1, 1, SpatialAttention, []]                         # P4/16   27

  - [[19,23,27], 1, Detect, [nc]]  # Detect(P2/4, P3/8, P4/16) 